import 'package:flutter/material.dart';

class Mod {
  static List<String> emoji = [
    "😀 😃 😄 😁 😆 😅",
    "😍 🥰 😘 😗 😙 😚",
    "☺ 😊 😇 🙂 🙃",
    "🧐 🤓 😎 🤩 🥳",
    "😖 😫 😩 🥺 😢 😭",
    "🥰	🥰	🥰	🥰	🥰	🥰	🥰"
  ];
  static List<String> fontfamily = [
    "f1",
    "f2",
    "f3",
    "f4",
    "f5",
    "f6",
    "f7",
    "f8",
    "f9",
    "f10",
    "f11",
    "f12",
    "f13",
    "f14",
    "f15",
    "f16",
    "f17"
  ];

  static List<Color> color = [
    Color(0xffF9CE00),
    Color(0xff08ffc8),
    Color(0xffdadada),
    Color(0xff204969),
    Color(0xffe41749),
    Color(0xfff5587b),
    Color(0xffff8a5c),
    Color(0xfffff591),
    Color(0xff96ceb4),
    Color(0xffd9534f),
  ];

  static List pre = [
    '''ये ज़िन्दगी हसीं है इस से प्यार करो,अभी है रात तो सुबह का इंतज़ार करो,
वो पल भी आएगा जिसकी ख्वाहिश है आपको,
रब पर रखो भरोसा वक़्त पर एतबार करो।''',
    '''हौसले भी किसी हकीम से कम नहीं होते,हर तकलीफ़ में ताकत की दवा देते हैं।''',
    '''यही सोच कर हर तपिश में जलता आया हूँ,धूप कितनी भी तेज हो समंदर नहीं सूखा करते।''',
    '''लकीरें अपने हाथों की बनाना हमको आता है,वो कोई और होंगे अपनी किस्मत पे जो रोते हैं।''',
    '''काम करो ऐसा कि एक पहचान बन जाये,हर कदम ऐसा चलो कि निशान बन जाये,
यहाँ ज़िन्दगी तो हर कोई काट लेता है,
ज़िन्दगी जियो इस कदर कि मिसाल बन जाये।''',
    '''दीया बुझाने की फितरत बदल भी सकती है,कोई चिराग हवा पे दवाब तो डाले।''',
    '''જે માણસ સાચો હોય છે તે લોકો ના હૃદય માં રહે છે. પણ જે માણસ દયાળુ હોય છે તે ઈશ્વર ના હૃદય માં રહે છે. જીવન મા બીજા કરતા મોડી સફળતા મળે તો નિરાસ ના થતા, કેમકે મકાન કરતા મહેલ ચણવામાં વાર લાગે છે.

''',
    '''જ્યારથી “પરીક્ષાની જિંદગી” પૂરી થઇ છે, ત્યારથી “જિંદગીની પરીક્ષાઓ” શરુ થઇ છે. થાકી ને બેઠો છું હારી ને નહીં, બાજી ગઈ છે જિંદગી નહીં એક તારીખ બદલાશે ખાલી આજે, જીંદગી તો તારે જાતે બદલવી પડશે.

''',
    '''વિશાળ દરિયા ના ખારા પાણી બનીને શું કરશો? બનવું હોય તો બનો મીઠા ઝરણાં ના “”નીર”” , જ્યાં સિંહ પણ ઝૂકી ને પાણી પીએ છે.''',
    '''સાચા સંબધ ની સુંદરતા એક બીજા ની ભૂલો સહન કરવા માં જ છે, કારણ કે ભૂલ વગર નો મનુષ્ય શોધવા જશો તો આખી જિંદગી એકલા જ રહી જશો.''',
    '''” સમય” ને ઓળખતા
” પ્રસંગ ” ને સાચવતા
” માણસ ” ને સમજાવતા
અને
” તક ” ને ઝડપતા
આવડી ગયું તો સમજ જો કે
” જીંદગી જીતી ગયા અને જીવી ગયા”…''',
    '''આવતી કાલે પહાડ ખસેડવો હોય તો દોસ્ત,આજે પથ્થરો ખસેડવાની શરૂઆત કરવી પડે !!''',
    '''કિનારે ઉભા રહી પાણી જોવાથી,ક્યારેય નદી પાર નહીં થાય દોસ્ત !!''',
  ];
  static List love = [
    '''Naseeb vale hote he vo log,
    Jinaki phikr karanevala,
Aur chahat karanevala koi nahin hota.''',
    '''Kabhi kabhee meri baat bhi,
Samajh liya karo,
Is duniya mein,
Tumhare siva he hi kaun,
Mujhe samajh ne vala.
''',
    '''Jab apaka nam zuban par ata he,
Pata nahin dil kyon muskurata he,
Tasalli hoti he hamare dil ko,
Ki koi to apana he is duniya mein,
Jo har vakt hamen yad ata he.''',
    '''Dooriyan bahut hai magar itna samajh lo, 
Paas rehkar hi koi khas nahi hota,
 Tum iss kadar paas ho mere dil ke..
 Mujhe dooriyon ka Ehsaas nahi hota.''',
    '''Safar Wahi Tak Hain Jaha Tak Tum Ho, 
 Nazar Wahi Tak Hain Jaha Tak Tum Ho, 
 Phool Bahut Dekhe Hain Is Gulshan Mein, 
 Khusbu Wahi Tak Hain Jaha Tak Tum Ho.''',
    '''Chupke se dhadkan me utar jaayenge, 
 Raahen Ulfat me had se guzar jaayenge, 
 Aap jo hamen itna chahenge, 
 Hum to aapki saanson me pighal jaayenge.''',
    '''પ્રેમ માં મીઠી વેદના મળી એ બહુ
છે સ્વપ્નો ને નવી દિશા મળી એ
બહુ છે પ્રેમ પૂરો થયો કે અધુરો
રાય્હો વાત એ નથી પ્રેમ કરવાનો
અવસર મળ્યો એ બહુ છે…''',
    '''પગ માં ખુન્ચાયેલા કાટા એ તો બતાવ્યું
કે સાહેબ આ ગલી માં જરૂર ગુલાબ છે''',
    '''તારા હૃદય પર બરફની પરત તો નથી ?
હું સ્પર્શ કરવા જાઊં ને ફિસલી જવાય.''',
    '''તારી આંખના ઇશારા પર,
મને મરતાં ન આવડયું. પ્રેમ સાગરમાં ડૂબ્યો પણ,
મને તરતાં ન આવડયું.''',
    '''નીરખી તેનું રૂપ ચાંદ પણ હરખાય છે,
બાગ કેરા ફૂલ તેને જોઈ ને કરમાય છે,
પણ ઈશ્વર ની આ કેવી વિચિત્ર કળા,
કે બધા ને શરમાવનારી મને જોઈ ને શરમાય છે..''',

  ];
  static List sad = [
    '''Har kadam Har pal saath hai,
    Dur hokar bhi hum aapke pass hai, 
    Aapko ho na ho par hume aapki kasam, 
    Aapki kami ka har pal ehsaas hai.''',
    '''Aankho ki gehrai ko samajh nahi sakte, 
    Honto se kuch keh nahi sakte, 
    Kaise baya kare hum aapko yeh dil ka haal ki, 
    Tumhi ho jiske bageir hum reh nahi sakte.''',
    '''Khoya itna kuch ki hume paana na aaya, 
    Pyar kar to liya par jatana na aaya. 
    Aa gaye tum is dil mein pehli hi nazar mei, 
    Bas hame aaoke dil mein samana na aaya.''',
    '''Jis Din Sapno Me Unka Didaar Ho Jata Hai, 
    Us Raat Sona Bhi Duswaar Ho Jata Hai, 
    Marta Hai Koi Hum Par Bhi, 
    Ye Soch Kar Apne Aap Se Pyaar Ho Jata Hai''',
    '''Chehre pe mere zulfo ko phailao kisi din, 
    Kyu roz sirf garajate ho, baras jao kisi din, 
    Khushbu ki tarah guzro mere dil ki gali se, 
    Phulon ki tarah mujpe bikhar jao kisi din.''',
    '''Na gulfaam chahiye, 
    Na salaam chahiye, 
    Na mubarak ka koi paigam chahiye, 
    Jisko pee ker hosh kho jayain, 
    Labon ko aisa.. jaam chahiye!!''',
    '''જે સમયસર રીપ્લાઈ નથી આપતી એ સમય આવે ત્યારે સાથ શું આપશે ?''',
    '''શાયરી ની દુનિયામાં પગલું માંડ્યું ત્યારે ખબર પડી, દુઃખ ની મહેફિલમા પણ વાહ..વાહ..બોલાય છે.''',
    '''તારી યાદને આદત પડી ગયી રોજ મારી પાસેઆવવાની, નહીતર મને ક્યા આદત હતી, રોજ તને યાદ કરવાની.''',
    '''શોધવાથી એ લોકો મળે જે ખોવાય ગયા હોય, એ લોકો ના મળે જે બદલાય ગયા હોય.''',
    '''હું ક્યાં તને કહું છુ કે તુ મને પ્રેમ કર, બસ એક મારી તકલીફને તો મહેસુસ કર.''',
    '''જેના દિલ પર વાગે છે એ આંખોથી નથી રોતા, જે પોતાના નથી થયા એ કોઈના નથી થયા, સમય કાયમ એજ શીખવાડે છે કે સપના તૂટી જાય છે પણ પુરા નથી થતા.''',

  ];
  static List funn = [
    '''Ek ladki ko dekha to Aisa laga, 
    Dusri ladki ko dekha to Waisa laga.!! . . . . 
    Jab dono ne thappad mara to ek Jaisa laga…..!!!''',
    '''Hum yaad tujhi ko karte he 
    Har Ek ada pe marte he 
    Ek hi baat se darte he ki,
    Aap CLOSE-UP kyo nahi karte he…..''',
    '''Katal karna hai to nigahon se kar 
    talwar me kya rakha hai 
    Pyar karna hai to mujhse kar 
    mere doston me kya rakha hai.''',
    '''Na pyar, na yar, 
    na mohhabat, na dosti yaro, 
    aaj k ye devdas ki bat mano yaro, 
    na chandramukhi, na paro, 
    BUS HAR LADKI PAR LINE MARO!''',
    '''Charo taraf Padhai ka Saya h 
    Har paper me zero nazar aya h 
    Hm to yuhi Chale jate h bina Muh dhoye Xm dene , 
    Or log kehte he Sala raat bhar Padhai kr k aaya h….
''',
    '''Zindagi Ki Har Ek Udaan Baaki Hai 
Har Mod Pr Ek Imtihan Baki Hai 
Abhi To Sirf Aap Hi Pareshan Hai Mujhse 
Abhi To Pura Hindustan Baaki Hai''',
    '''Kamar jitni bhi patli ho maza utna nasheela hai. 
chalega jo bhi ho aankhon ka rang kala ya neela hai, 
ishq k naam pe kerte sabhi ab RASLEELA he.. 
main karun to saala character dheelaa hai''',
    '''Aavta haso cho. Jata haso cho.
Savare haso cho. Ratre haso cho.
Sukh ma haso cho. Dukh ma haso cho.
Tamne shu lage cheee ? ? ?
Tame ekla j "Close UP" ghaso chooo ???''',
    '''Javani aave to masti lage che,
paranya pacchi te sasti lage che,
teniyo aave to vasti lage che,
ane pacchi to love letter pan pasti lage che.''',
    '''Mara maran par tame aansoo na bahavsho,
Mara maran par dosto gam na karsho..
Mari yad aave to sidha upar j aavjo!''',
    '''Devu che Dil maru Daan Ma..
Wah.. wah.. wah wah
Devu che Dil maru Daan Ma..
Wah.. wah.. wah wah
Devu che Dil maru Daan Ma..
Che Koi "janu" tamara Dhyan Ma.. ??
Wah wah..''',
    ''' Prem to amare pan karvo hato,
pan vaat khas thai nahi,
tajmahal to amare pan bhandvo hato,
pan afsoss ke loan pas thai nahi.''',
    '''Man gamta sathi no sath lai avish,
mithi madh bhari yaad lai ne aavish,
tame 1 var tarsya to thav,
hu rupiya nu thanda pani nu pouch lai ne aavish.''',
  ];
  static List poli = [
    '''मैं अपनी आँख पर चशमाँ चढ़ा कर देखता हूँ
हुनर ज़ितना हैं सारा आजमा कर देखता हूँ
नजर उतना ही आता हैं की ज़ितना वो दिखाता है
मैं छोटा हू मगर हर बार कद अपना बढ़ा कर देखता हूँ''',
    '''सियासत की रंगत में ना डूबो इतना,
कि वीरों की शहादत भी नजर ना आए,
जरा सा याद कर लो अपने वायदे जुबान को,
गर तुम्हे अपनी जुबां का कहा याद आए.''',
    '''लड़ें, झगड़ें, भिड़ें, काटें, कटें, शमशीर हो जाएँ,
बटें, बाँटें, चुभे इक दुसरे को, तीर हो जाएँ,
मुसलसल कत्ल-ओ-गारत की नई तस्वीर हो जाएँ,
सियासत चाहती हैं हम और तुम कश्मीर हो जाएँ.''',
    '''दोस्ती हो या दुश्मनी सलामी दूर से अच्छी लगती हैं,
राजनीति में कोई नही सगा, ये बात सच्ची लगती हैं.''',
    '''हर कोई यहाँ किसी न किसी पार्टी के विचारो का गुलाम हैं,
इसलिए भारत का ये हाल हैं, किसान बेहाल हैं. नेता माला-माल हैं.''',
    '''जो धरापुत्र का वध कर दे, वह राजपुरूष नाकारा हैं,
जिस धरती पर किसान का रक्त गिरे उसका शासक हत्यारा हैं.''',
  ];
  static List desh = [
    '''मेरे मुल्क की हिफाज़त ही मेरा फ़र्ज है
और मेरा मुल्क ही मेरी जान है,
इस पर कुर्बान है मेरा सब कुछ,
नही इससे बढ़कर मुझको अपनी जान है।''',
    '''तीन रंग का नही वस्त्र, ये ध्वज देश की शान है,
हर भारतीय के दिलो का स्वाभिमान है,
यही है गंगा, यही हैं हिमालय, यही हिन्द की जान है
और तीन रंगों में रंगा हुआ ये अपना हिन्दुस्तान हैं।''',
    '''लहू वतन के शहीदों का रंग लाया है,
उछ्ल रहा है ज़माने में नाम-ए-आज़ादी।''',
    '''भारतमाता तुम्हें पुकारे आना ही होगा,
कर्ज अपने देश का चुकाना ही होगा,
दे करके कुर्बानी अपनी जान की,
तुम्हे मरना भी होगा मारना भी होगा।''',
    '''मैं अपने देश का हरदम सम्मान करता हूँ,
यहाँ की मिट्टी का ही गुणगान करता हूँ,
मुझे डर नहीं है अपनी मौत से,
तिरंगा बने कफ़न मेरा, यही अरमान रखता हूँ।''',
    '''वतन की ख़ाक ज़रा एड़ियां रगड़ने दे,
मुझे यक़ीन है पानी यहीं से निकलेगा।'''
        '''ज़माने भर में मिलते हे आशिक कई , मगर वतन से खूबसूरत कोई सनम नहीं होता , नोटों में भी लिपट कर, सोने में सिमटकर मरे हे कई , मगर तिरंगे से खूबसूरत कोई कफ़न नहीं होता.''',
    '''मैं भारत बरस का हरदम सम्मान करता हूँ, यहाँ की चांदनी मिट्टी का ही गुणगान करता हुँ, मुझे चिंता नहीं है स्वर्ग जाकर मोक्ष पाने की, तिरंगा हो कफ़न मेरा, बस यही अरमान रखता हूँ.''',
    '''फिर उड़ गई नींद मेरी यह सोचकर, कि जो शहीदों का बहा वो खून मेरी नींद के लिए था.''',
    '''मैं जला हुआ राख नही, अमर दीप हूँ, जो मिट गया वतन पर, मैं वो शहीद हूँ.''',
    '''दुश्मन की गोलियों का हम सामना करेंगें, आजाद हैं और आजाद ही रहेंगें.''',
    '''दिल से निकलेगी न मर कर भी वतन की नफरत, मेरी मिटटी से भी खुशबू-ए-वफ़ा आयेगी.''',
    '''भारतमाता तुम्हें पुकारे आना ही होगा, कर्ज अपने देश का चुकाना ही होगा, दे करके कुर्बानी अपनी जान की, तुम्हे मरना भी होगा मारना भी होगा.''',
    '''मैं अपने देश का हरदम सम्मान करता हूँ, यहाँ की मिट्टी का ही गुणगान करता हूँ, मुझे डर नहीं है अपनी मौत से,तिरंगा बने कफ़न मेरा, यही अरमान रखता हूँ.''',
    '''ये बात हवाओं को बताये रखना, रौशनी होगी बस चिरागों को जलाये रखना, लहू देकर जिसकी हिफाज़त हमने की, ऐसे तिरंगे को सदा दिल में बसाये रखना.''',
  ];
  static List dost = [
    """Aasmaan Se Tod Kar Sitara Diya Hai,
  Aalam-e-Tanhai Mein Ek Sharara Diya Hai,
      Meri Kismat Bhi Naaz Karti Hai Mujhpe,
      Khuda Ne Dost Hi Itna Pyara Diya Hai.""",
    """Dosti Mein Dost, Dost Ka Khuda Hota Hai,
Mahsoos Tab Hota Hai Jab Wo Juda Hota Hai.""",
    """Na Tum Door Jaana Na Hum Door Jayenge,
Apne-Apne Hisse Ki Dosti Ko Nibhayenge.""",
    """Hum Jab Bhi Aapki Duniya Se Jayenge,
  Itni Khushiyan Aur Apnapan De Jayenge,
      Ke Jab Bhi Yaad Karoge Is Pagal Dost Ko,
      Hansti Aankhon Se Aansoo Nikal Aayenge.""",
    """Dosti Naam Hai Sukh-Dukh Ki Kahani Ka,
Dosti Raaz Hai Sadaa Hi Muskurane Ka,
Ye Koi Pal Bhar Ki Pehchan Nahi Hai,
Dosti Vaada Hai Umr Bhar Saath Nibhane Ka.""",
    """Sachche Dost Kabhi Girne Nahi Dete,
Na Kisi Ki Najron Se Na Kisi Ke Kadmon Mein."""
  ];
  static List birth = [
    """Aapke JanamDin Par Hum Dete Hain Ye Duaa,
      Khushiyan Aapke Daaman Se Kabhi Na Hon Juda,
  Khuda Ki Rahmaton Mein Kabhi Kami Na Aaye,
      Aapke Honthho Ki Ye Muskurahat Na Jaaye.""",
    """Duniya Ki Khushiyan Aapko Mil Jayein,
Apno Se Mil Ke Aapka Man Khil Jaye,
Chehre Par Dukh Ki Kabhi Shikan Na Ho,
Aapke Birthday Par Meri ShubKamnayein.""",
    """दिल से मेरी दुआ है कि खुश रहो तुम,
मिले न कोई गम जहाँ भी रहो तुम,
समंदर की तरह दिल है गहरा तुम्हारा,
सदा खुशियों से भरा रहे दामन तुम्हारा।
जन्मदिन मुबारक हो।""",
    """Chehra Aapka Khila Rahe Gulaab Ki Tarah,
Naam Aapka Roshan Rahe Aaftab Ki Tarah,
Gham Mein Bhi Aap Hanste Rehna Phoolon Ki Tarah,
Agar Hum Iss Duniya Mein Na Rahein Aaj Ki Tarah,
Toh Bhi Apna Janamdin Manaate Rehna Isi Tarah.""",
    """Ho Puri Dil Ki Har Khwahish Aapke,
Aur Mile Khushiyon Ka Jahan Aapko,
Agar Aap Mange Aasma Ka Ek Tara,
To Khuda Dede Sara Aasma Aapko.
Happy Birthday My Dear.""",
    """यही दुआ करता हूँ खुदा से,
आपकी जिंदगी में कोई गम न हो,
जन्मदिन पर मिले हजारों खुशियाँ,
चाहे उनमें शामिल हम न हों।"""
  ];
  static List bottal = [
    """Nasha Ham Kiya Karte Hain
Ilzaam Sharab Ko Diya Karte Hain,
Kasoor Sharab Ka Nahin Unka Hai
Jiska Chehra Ham Jaam Mein Talash Kiya Karte Hain.""",
    """Ek Sharab Ki Botal Daboch Rakhi Hai,
Tujhe Bhulane Ki Tarakeeb Soch Rakh Hai.""",
    """Ham To Badnaam Huye Kuchh Is Kadar Dosto,
Ki Paani Bhi Piyen To Log Sharab Kahate Hain.""",
    """बहुत अमीर होती है ये शराब की बोतलें,
पैसा चाहे जो भी लग जाए सारे ग़म ख़रीद लेतीं हैं।""",
    """Na Jakhm Bhare, Na Sharab Sahara Hui, 
Na Wo Vapas Lauti Na Mohabbat Dobara Hui.""",
    """कुछ भी बचा न कहने को हर बात हो गई,
आओ कहीं शराब पिएँ रात हो गई।"""
  ];
  static List<String> arr = [
    "image/OIP.png",
    "image/R.png",
    "image/Sad.png",
    "image/funny.png",
    "image/political.png",
    "image/flag1.png",
    "image/friend.png",
    "image/birthday.png",
    "image/bottal.png"
  ];
  static List<String> name = [
    "Prerana",
    "Love",
    "Sad",
    "Funny Love",
    "Political",
    "Desh Bhakti",
    "Friend Zone",
    "Happy Birthday",
    "Bottal"
  ];
}
